{
  "title": "What Were Hongkongers Doing In hot summer of 2019",
  "subtitle": "ANTI-EXTRADITION BILL At A Glance",
  "events": {
    "2018": {
      "DEC": {
        "4": [{
            "type": "timeline",
            "title": "A Hong Kong Man KILLED His GIRLFRIEND in Taiwan",
            "content": "Now hiding in HK, Chan Tong-kai was wanted by Taiwan for murdering his pregnant girlfriend while in Taiwan."
        }]
      }
    },
    "2019": {
      "FEB": {
        "13": [{
          "type": "timeline",
          "title": "EXTRADITION law AMENDMENT Bill Proposed",
          "content": "HK government proposed an Extradititon Law Amendment Bill that would allow for fugitives like Chan to be sent to other places including Taiwan and mainland China."
        }]
      },
      "MAR": {
        "31": [{
          "type": "timeline",
          "title": "FIRST ANTI-BILL MARCH",
          "content": "12,000 people took to the street."
        }]
      },
      "APR": {
        "3": [{
          "type": "timeline",
          "title": "first reading of the bill",
          "content": ""
        }],
        "28": [{
          "type": "timeline",
          "title": "SECOND ANTI-BILL MARCH",
          "content": "130,000 people took to the street."
        }]
      },
      "MAY": {
        "10": [{
          "type": "timeline",
          "title": "Taiwan said it won’t ask for MURDER suspect",
          "content": "Taiwan said it won’t ask HK to send Chan even if the bill passed into law, as the bill puts TW citizens at risk of Communist China's reach."
        }]
      },
      "JUN": {
        "9": [
          {
            "type": "timeline",
            "title": "THIRD ANTI-BILL MARCH",
            "content": "One million people took to the streets to call for the withdrawal of the extradition bill."
          },
          {
            "type": "response",
            "responder": "gov",
            "content": "Government issued a statement an hour after the march, stating the Second Reading will go ahead according to schedule on July 12."
          }
        ],
        "12": [
          {
            "type": "timeline",
            "title": "Class boycott and strikes",
            "content": ""
          },
          {
            "type": "timeline",
            "title": "Second reading postponed as Parliament blockaded",
            "content": "Police used excessive force against protesters, firing rubber bullets aimed at the head without warning. Multiple incidents of police assaulting press were caught on camera. 150 rounds of tear gas, 20 bean bag rounds, and no less than 10 rounds of rubber bullets were fired."
          }
        ],
        "15": [
          {
            "type": "scarification",
            "title": "DEATH OF THE FIRST PROTESTER",
            "content": "A man unfurled an anti-bill banner and jumped to his death at Pacific Place."
          },
          {
            "type": "timeline",
            "title": "Bill Put on Hold",
            "content": "HK Chief Carrie Lam announced the bill is now PUT ON HOLD at a press conference."
          },
          {
            "type": "response",
            "responder": "carrie",
            "content": "No response to any of the FOUR DEMANDS."
          }
        ],
        "16": [
          {
            "type": "timeline",
            "title": "fourth ANTI-Bill MARCH",
            "content": "Two million people took to the street urging the government to respond to the following demands."
          },
          {
            "type": "demands",
            "title": "FOUR DEMANDS",
            "demands": [
              "COMPLETE WITHDRAWAL OF THE EXTRADITION BILL",
              "INVESTIGATE POLICE FORCE FOR POLICE BRUTALITY",
              "RETRACT ʻRIOTʼ CHARACTERIZATION OF THE JUNE 12 PROTEST",
              "DROP CHARGES AGAINST ALL ARRESTED PROTESTERS"
            ]
          }
        ],
        "18": [
          {
            "type": "timeline",
            "title": "CARRIE LAM Apologized",
            "content": "Lam made a ‘sincere apologiy’ to HK citizens at a press conference."
          },
          {
            "type": "response",
            "responder": "carrie",
            "content": "However, Lam still failed to respond to any of the four demands, nor stating whether the bill will be COMPLETELY WITHDRAWN, as opposed to merely put on hold."
          }
        ],
        "19": [{
          "type": "timeline",
          "title": "PROTESTERS Set A DEADLINE for Government RESPONSE",
          "content": "Six student unions issueed a joint statement, appealing the government to respond to the FOUR DEMANDS by 5pm June 20, stating that failure to meet deadline will lead to escalated actions."
        }],
        "20": [{
          "type": "response",
          "responder": "gov",
          "content": "The government failied to respond to the four demands by the 5pm deadline."
        }],
        "21": [
          {
            "type": "timeline",
            "title": "post-deadline Escalation - Occupation of government OFFICES",
            "content": "Protesters occupied the foyers of the Revenue Tower in an act of civil disobedience to disrupt government operations."
          },
          {
            "type": "timeline",
            "title": "post-deadline Escalation - SIEGE of police HeadQuaters",
            "content": "Protesters besieged the police HQ around noon time, demanding dialogue with Police Commissioner Stephen Lo to no avail. Police cleared the scene in the late evening."
          },
          {
            "type": "response",
            "responder": "lo",
            "content": "Lo did not come out to meet over the day-long siege."
          }
        ],
        "26": [
          {
            "type": "timeline",
            "title": "“Liberate HK” March",
            "content": "1,500 protesters visited nineteen G20 embassies to deliver letters, pleading G20 leaders to raise concerns about Hong Kong at the upcoming summit."
          },
          {
            "type": "timeline",
            "title": "ESCALATION - GATHERING AT DOJ Offices",
            "content": "Protesters gathered outside Department of Justice offices demanding dialogue, urging Secretary for Justice Teresa Cheng to absolve arrested protesters and retract the ‘riot’ characterization of the June 12 protest."
          },
          {
            "type": "response",
            "responder": "cheng",
            "content": "Cheng did not come out to meet."
          },
          {
            "type": "timeline",
            "title": "“G20 Free HK” assembly",
            "content": "Thousands gathered at Edinburgh Place in the evening calling on G20 countries to speak up for HK."
          }
        ],
        "27": [{
          "type": "timeline",
          "title": "“Stand with HK” ad campaign - fund raising",
          "content": "In order to plead G20 leaders to act over the crisis in HK, netizens launched a crowdfunding campaign to place front-page ads in major international newspapers. The campaign raised a whopping 6.7 million within hours, way over the target budget of 3 millions."
        }],
        "28": [{
          "type": "timeline",
          "title": "“Stand with HK” ad campaign - AD PLACED ON NewsAPErS Across 13 COUNTRIES",
          "content": "A series of ads featuring pleas for readers from G20 countries were placed on 19 newspapers across 13 countries, including New York Times, The Guardian, The Australian, 朝日新聞, and 동아일보."
        }],
        "29": [],
        "30": [{
          "type": "scarification",
          "title": "DEATH OF THE 2ND and 3RD PROTESTeRS",
          "content": "More took their lives leaving behind suicide notes condemning the government’s inaction. A vigil was held outside of the parliament."
        }]
      },
      "JUL": {
        "1": [
          {
            "type": "timeline",
            "title": "JULY 1 MARCH",
            "content": "550,000 people took to the street."
          },
          {
            "type": "timeline",
            "title": "Chinese Communist Party Founding Day - Black Flag Hoisted in HK",
            "content": "To commemorate the handover of HK, the Communist China flag is raised on July 1 each year. Due to the protest, the ceremony moved indoor this year."
          },
          {
            "type": "timeline",
            "title": "",
            "content": "Protesters took over the original flag poles, lowered the HK flag to half-mast and raised the Black Bauhinia flag, symbolic of the protest, replacing the Communist China flag."
          },
          {
            "type": "timeline",
            "title": "Storming of Parliament",
            "content": "Protestors stormed the parliament, and in a symbolic act of defiance defaced the Communist Hong Kong emblem."
          },
          {
            "type": "timeline",
            "title": "",
            "content": "One of the protesters took off his mask, revealing himself to be Brian Leung, a co-editor of renowned Hong Kong University publication “Hong Kong Nationalism”. Following his lead, the protesters delivered the “Manifesto of HK Protesters” and fled the scene before police arrived."
          }
        ],
        "2": [
          {
            "type": "timeline",
            "title": "THE 4 a.m. Press Conference",
            "content": "Lam called for a press conference at 4 a.m. only to rehash the same old lines condemning protester violence."
          },
          {
            "type": "response",
            "responder": "carrie",
            "content": "Lam declined to respond to any of the FOUR DEMANDS, insisting the bill had already been PUT ON HOLD."
          }
        ],
        "3": [{
          "type": "scarification",
          "title": "DEATH OF THE 4TH PROTESTER",
          "content": ""
        }],
        "7": [{
          "type": "timeline",
          "title": "“Take back HK“ Movement Kicked Off at Tsim Sha Tsui",
          "content": "Protesters resolved to hold marches all over HK. 23,000 people took part in a march across Tsim Sha Tsui, first in a series of “Take Back HK” marches."
        }],
        "9": [
          {
            "type": "timeline",
            "title": "Bill Pronounced Dead",
            "content": "Lam admitted failure to push the bill, stated at this point “the bill is dead” at a press conference."
          },
          {
            "type": "response",
            "responder": "carrie",
            "content": "However, the DEATH of a bill is legally unfounded. It is as if Lam was under a curse barring her from saying “COMPLETELY WITHDRAWN”. FOUR DEMANDS still not responded"
          }
        ]
      }
    }
  }
}
